<template>
  <div class="pt-8">
    <div class="container mx-auto">
      <div
        class="
          overflow-hidden
          rounded
          flex flex-col
          bg-gradient-to-b
          from-brand-1
          via-brand-2
          to-brand-3
          pb-16
        "
      >
        <div class="h-96 w-full rounded-b-2xl overflow-hidden">
          <img
            draggable="false"
            src="/709100.png"
            class="w-full h-full object-cover object-center"
          >
        </div>
        <div class="px-8 py-4">
          <h1 class="text-white font-bold text-lg">
            فیلم Blue ray
          </h1>
          <ul class="flex gap-4 mt-2">
            <li class="flex gap-1 items-center">
              <svg class="w-5 h-5 text-brand-1" viewBox="0 0 24 24">
                <path
                  fill="currentColor"
                  d="M12,9A3,3 0 0,0 9,12A3,3 0 0,0 12,15A3,3 0 0,0 15,12A3,3 0 0,0 12,9M12,17A5,5 0 0,1 7,12A5,5 0 0,1 12,7A5,5 0 0,1 17,12A5,5 0 0,1 12,17M12,4.5C7,4.5 2.73,7.61 1,12C2.73,16.39 7,19.5 12,19.5C17,19.5 21.27,16.39 23,12C21.27,7.61 17,4.5 12,4.5Z"
                />
              </svg>
              <span class="text-xs pt-1 text-white">24</span>
            </li>
            <li class="flex gap-1 items-center">
              <svg class="w-5 h-5 text-brand-1" viewBox="0 0 24 24">
                <path fill="currentColor" d="M21 11.11V5C21 3.9 20.11 3 19 3H14.82C14.4 1.84 13.3 1 12 1S9.6 1.84 9.18 3H5C3.9 3 3 3.9 3 5V19C3 20.11 3.9 21 5 21H11.11C12.37 22.24 14.09 23 16 23C19.87 23 23 19.87 23 16C23 14.09 22.24 12.37 21 11.11M12 3C12.55 3 13 3.45 13 4S12.55 5 12 5 11 4.55 11 4 11.45 3 12 3M6 7H18V9H6V7M9.08 17H6V15H9.08C9.03 15.33 9 15.66 9 16S9.03 16.67 9.08 17M6 13V11H11.11C10.5 11.57 10.04 12.25 9.68 13H6M16 21C13.24 21 11 18.76 11 16S13.24 11 16 11 21 13.24 21 16 18.76 21 16 21M16.5 16.25L19.36 17.94L18.61 19.16L15 17V12H16.5V16.25Z" />
              </svg>
              <span class="text-xs pt-1 text-white">1400/01/01</span>
            </li>
            <li class="flex gap-1 items-center">
              <svg class="w-5 h-5 text-brand-1" viewBox="0 0 24 24">
                <path fill="currentColor" d="M18,16.08C17.24,16.08 16.56,16.38 16.04,16.85L8.91,12.7C8.96,12.47 9,12.24 9,12C9,11.76 8.96,11.53 8.91,11.3L15.96,7.19C16.5,7.69 17.21,8 18,8A3,3 0 0,0 21,5A3,3 0 0,0 18,2A3,3 0 0,0 15,5C15,5.24 15.04,5.47 15.09,5.7L8.04,9.81C7.5,9.31 6.79,9 6,9A3,3 0 0,0 3,12A3,3 0 0,0 6,15C6.79,15 7.5,14.69 8.04,14.19L15.16,18.34C15.11,18.55 15.08,18.77 15.08,19C15.08,20.61 16.39,21.91 18,21.91C19.61,21.91 20.92,20.61 20.92,19A2.92,2.92 0 0,0 18,16.08Z" />
              </svg>
            </li>
          </ul>
          <p class="text-white text-sm mt-4 text-justify">
            لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
            بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
            گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
            ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
            از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.
            معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و
            بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند
            که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد
            چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته
            شده‌است. از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت
            حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن
            می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را
            صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند. لورم
            ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
            بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
            گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
            ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
            از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.
            معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و
            بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند
            که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد
            چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته
            شده‌است. از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت
            حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن
            می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را
            صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند.
          </p>
        </div>
      </div>
    </div>
    <AppBest class="mt-6" />
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
import AppBest from '~/components/app-best.vue'

export default Vue.extend({
  name: 'AppNewPage',
  components: {
    AppBest
  }
})
</script>

<style lang="scss" scoped>
</style>
